Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_trial/criminal_insanity_and_mental_health.html.txt.tmx
Source language: en
Languages: ga

source: Criminal insanity and mental health
ga: Gealtacht choiriúil agus meabhairshláinte

source: People who are charged with a criminal offence and who are suffering from a mental disorder are dealt with under the Criminal Law (Insanity) Act 2006 as amended by the Criminal Law (Insanity) Act 2010
ga: Déileáiltear le daoine a chúisítear le cion coiriúil agus atá thíos le neamhord meabhrach faoin Acht um an Dlí Coiriúil (Gealtacht) 2006 arna leasú ag an tAcht um an Dlí Coiriúil (Gealtacht) 2010

source: The question of the mental state of someone charged with a crime may arise at 2 different stages - at the start of the trial and at the decision on guilt
ga: D’fhéadfadh an cheist maidir le staid mheabhrach duine a chúisítear le coir eascairt ag dhá chéim ar leith – ag tús na trialach agus nuair a bhíonn an cinneadh á dhéanamh maidir le ciontacht

source: If a person is suffering from a mental disorder, they may be considered unfit to be tried at the start of the trial
ga: Má tá duine thíos le neamhord meabhrach, féadtar a mheas nár cheart iad a thriail ag tús na trialach

source: In that case, no trial goes ahead
ga: Sa chás sin, ní ghabhtar ar aghaidh leis an triail

source: If a trial is held and the person is considered to have actually committed the offence but was insane at the time, it is possible for a verdict of not guilty by reason of insanity to be reached
ga: Má bhíonn triail ar siúl agus má mheastar go ndearna an duine an cion ach go raibh siad gealtach ag an tráth sin, d’fhéadfadh go mbainfí an breithiúnas amach go bhfuil siad neamhchiontach toisc bheith gealtach

source: In murder cases, the concept of diminished responsibility may be used to substitute a verdict of manslaughter
ga: I gcásanna dúnmharaithe, d’fhéadfaí coincheap na freagrachta laghdaithe a úsáid chun breithiúnas dúnorgana a ionadú

source: A mental disorder is defined in the 2006 Act as including mental illness, mental disability, dementia or any disease of the mind but does not include intoxication (drunkenness)
ga: Is é an sainmhíniú a thugtar ar neamhord meabhrach san Acht 2006 galar meabhrach, míchumas meabhrach, néaltrú nó aon ghalar intinne nach n-áirítear meisce (bheith ar meisce)

source: Fit or unfit to be tried
ga: Oiriúnach nó neamhoiriúnach le triail

source: The decision on whether or not a person is fit to be tried is made by a judge
ga: Déanann breitheamh an cinneadh ar cibé acu an bhfuil nó nach bhfuil duine oiriúnach le triail

source: If the person cannot understand the charge or is unable to instruct a legal team, challenge jurors or follow the evidence, then they may be considered unfit to be tried
ga: Murar féidir leis an duine an cúiseamh a thuiscint nó murar féidir leo foireann dlí a ordú, dúshlán a chur faoi na giúróirí nó an fhianaise a leanúint, féadtar a mheas nach bhfuil siad oiriúnach le triail

source: This finding (that is that someone is considered unfit to be tried) is not a decision on the alleged criminal activity
ga: Ní hionann an cinneadh seo, (is é sin, go meastar go bhfuil duine neamhoiriúnach le triail) agus cinneadh ar an ngníomhaíocht líomhnaithe choiriúil

source: If someone is found to be unfit to be tried, then the trial is postponed
ga: Má dheimhnítear go bhfuil duine neamhoiriúnach le triail, cuirtear an triail ar athló

source: The judge then decides what happens next
ga: Is é an breitheamh a dhéanann an cinneadh faoi céard a dhéantar ina dhiaidh sin

source: For example, the person may be committed to a psychiatric hospital or unit if they are considered to be suffering from a mental disorder and are in need of in-patient treatment under the terms of the Mental Health Act, 2001
ga: Mar shampla, d’fhéadfaí an duine a chur in ospidéal nó in aonad síciatrach má mheastar go bhfuil siad thíos le neamhord meabhrach agus go dteastaíonn cóireáil othair chónaithigh uathu faoi théarmaí an Achta Meabhair-Shláinte 2001

source: Alternatively, the person may be sent for out-patient psychiatric care
ga: Mar mhalairt air sin, d’fhéadfaí an duine a chur ar aghaidh chun cúram othair sheachtraigh shíciatraigh a fháil

source: The person may be committed to a psychiatric hospital or unit for 14 days in order to establish whether or not they should be sent for treatment
ga: Féadtar an duine a chur in ospidéal nó in aonad síciatrach ar feadh 14 lá d’fhonn a dheimhniú cibé acu ar cheart nó nár cheart iad a chur ar aghaidh chun cóireáil a fháil

source: The person may appeal against a committal order
ga: Féadfaidh an duine achomharc a dhéanamh i leith ordú cimithe

source: If the judge considers that there is a reasonable doubt that the person committed the alleged crime, the person may be acquitted
ga: Má mheasann an breitheamh gurb ann d’amhras réasúnta go ndearna an duine an choir líomhnaithe, féadtar an duine a éigiontú

source: The Director of Public Prosecutions may appeal against a decision that a person is unfit to be tried
ga: Féadfaidh an Stiúrthóir Ionchúiseamh Poiblí achomharc a dhéanamh i leith cinnidh go bhfuil duine neamhoiriúnach le triail

source: Not guilty by reason of insanity
ga: Neamhchiontach mar gheall ar ghealtacht

source: If someone is considered to have actually committed the offence but was insane at the time, the verdict may be not guilty by reason of insanity
ga: Má mheastar go ndearna an duine an cion ach go raibh siad gealtach ag an tráth sin, d’fhéadfadh go mbainfí an breithiúnas amach go bhfuil siad neamhchiontach toisc bheith gealtach

source: This decision is made by a jury
ga: Déanann giúiré an cinneadh seo

source: If this verdict is reached, the judge may order that the person be committed to a psychiatric hospital or unit in broadly the same way as applies in the case of being unfit to be tried
ga: Má bhaintear an breithiúnas seo amach, féadfaidh an breitheamh a ordú go gcuirtear an duine in ospidéal nó in aonad síciatrach ar an mbealach nach mór céanna a chuirtear daoine nach bhfuil oiriúnach le triail in ospidéal nó in aonad síciatrach

source: Diminished responsibility in murder cases
ga: Freagracht laghdaithe i gcásanna dúnmharaithe

source: If someone is charged with murder, the verdict of not guilty by reason of insanity is one possible verdict
ga: Má chúisítear duine le dúnmharú, breithiúnas féideartha amháin is ea neamhchiontach mar gheall ar ghealtacht

source: The Criminal Law (Insanity) Act 2006 provides for the concept of diminished responsibility in murder cases
ga: Forálann an tAcht um an Dlí Coiriúil (Gealtacht), 2006 do choincheap na freagrachta laghdaithe i gcásanna dúnmharaithe

source: A conviction for murder brings an automatic life sentence
ga: Gearrtar pianbhreith uathoibríoch shaoil ar chiontú le haghaidh dúnmharú

source: In other crimes, the judge has discretion in relation to sentencing and so can take into account any diminished responsibility which may exist
ga: I gcoireanna eile, tá an lánrogha ag an mbreitheamh i dtaca le pianbhreith a ghearradh agus, ar an ábhar sin, féadfaidh sé/sí aon fhreagracht laghdaithe a chur san áireamh a d’fhéadfadh bheith ann

source: If someone charged with murder successfully pleads diminished responsibility, then the verdict is manslaughter
ga: Má phléadálann duine a chúisítear le dúnmharú le freagracht laghdaithe, is é dúnorgain an breithiúnas

source: The judge can then sentence the person to any length of time in prison
ga: Ansin is féidir leis an mbreitheamh pianbhreith d’aon fhad sa phríosún a ghearradh ar an duine

source: Mental Health Review Board
ga: An Bord Athbhreithnithe Meabhair-Shláinte

source: The Mental Health (Criminal Law) Review Board's main function is to review the detention of those found not guilty by reason of insanity or unfit to be tried, who have been detained in a designated centre by order of a court
ga: Is í príomhfheidhm an Bhoird Athbhreithnithe Meabhair-Shláinte (an Dlí Coiriúil) athbhreithniú a dhéanamh ar choinneáil iad siúd a dheimhnítear nach bhfuil ciontach mar gheall ar ghealtacht nó a dheimhnítear nach bhfuil oiriúnach le triail, a coinníodh in ionad sannta le hordú cúirte

source: At present, the only designated centre is the Central Mental Hospital
ga: Is An Príomh-Ospidéal Meabhair-Ghalar é an t-aon ionad sannta amháin láithreach

source: The Review Board also has responsibility for people who have been convicted of offences and who become mentally ill while serving their sentences
ga: Anuas air sin, tá an Bord Athbhreithnithe freagrach as daoine a ciontaíodh i leith cionta agus ar tháinig breoiteacht mheabhrach orthu fad a bhí a bpianbhreitheanna á seirbheáil acu

source: The Review Board must have regard to the welfare and safety of the person whose detention it reviews and to the public interest
ga: Ní mór go mbeidh aird ag an mBord Athbhreithnithe ar leas agus ar shábháilteacht an duine a ndéanann siad athbhreithniú ar a gcoinneáil agus ar leas an phobail

source: It may assign a legal representative to the person unless the person proposes to engage one
ga: Féadfaidh siad ionadaí dlí a shannadh don duine mura mbeartaíonn an duine ionadaí dlí a fhostú

source: The Board is composed of a legal chairperson and a number of other people, at least one of whom must be a consultant psychiatrist
ga: Is éard atá sa Bhord ná cathaoirleach dlíthiúil agus líon daoine eile, ar gá go mbeadh duine amháin, ar a laghad, díobh ina s(h)íciatraí comhairleach

source: It is obliged to review each detention at least once every 6 months
ga: Tá dualgas orthu athbhreithniú a dhéanamh ar gach coinneáil ar a laghad uair amháin gach 6 mhí
